package wrapper

const PLATFORM_WEB = 0
const PLATFORM_SMART_TV = 1
const PLATFORM_APPS = 2

const COMPUTERS = 1
const MOBILE = 2
const TABLET = 3
const SMART_TV = 4
const WINDOWS = 5
const MAC_OS = 6
const COMPUTERS_OTHER = 7
const MOBILE_ANDROID = 8
const MOBILE_IOS = 9
const WINDOWS_PHONE = 10
const MOBILE_OTHER = 11
const TABLET_ANDROID = 12
const TABLET_IOS = 13
const TABLET_OTHER = 14
const SMART_TV_TIZEN = 15
const SMART_TV_WEBOS = 16

var ISO_3166_1_alpha_3 = map[string]string{
	"AF": "AFG", "AX": "ALA", "AL": "ALB", "DZ": "DZA", "AS": "ASM", "AD": "AND", "AO": "AGO", "AI": "AIA", "AQ": "ATA",
	"AG": "ATG", "AR": "ARG", "AM": "ARM", "AW": "ABW", "AU": "AUS", "AT": "AUT", "AZ": "AZE", "BS": "BHS", "BH": "BHR",
	"BD": "BGD", "BB": "BRB", "BY": "BLR", "BE": "BEL", "BZ": "BLZ", "BJ": "BEN", "BM": "BMU", "BT": "BTN", "BO": "BOL",
	"BQ": "BES", "BA": "BIH", "BW": "BWA", "BV": "BVT", "BR": "BRA", "IO": "IOT", "BN": "BRN", "BG": "BGR", "BF": "BFA",
	"BI": "BDI", "CV": "CPV", "KH": "KHM", "CM": "CMR", "CA": "CAN", "KY": "CYM", "CF": "CAF", "TD": "TCD", "CL": "CHL",
	"CN": "CHN", "CX": "CXR", "CC": "CCK", "CO": "COL", "KM": "COM", "CG": "COG", "CD": "COD", "CK": "COK", "CR": "CRI",
	"CI": "CIV", "HR": "HRV", "CU": "CUB", "CW": "CUW", "CY": "CYP", "CZ": "CZE", "DK": "DNK", "DJ": "DJI", "DM": "DMA",
	"DO": "DOM", "EC": "ECU", "EG": "EGY", "SV": "SLV", "GQ": "GNQ", "ER": "ERI", "EE": "EST", "ET": "ETH", "FK": "FLK",
	"FO": "FRO", "FJ": "FJI", "FI": "FIN", "FR": "FRA", "GF": "GUF", "PF": "PYF", "TF": "ATF", "GA": "GAB", "GM": "GMB",
	"GE": "GEO", "DE": "DEU", "GH": "GHA", "GI": "GIB", "GR": "GRC", "GL": "GRL", "GD": "GRD", "GP": "GLP", "GU": "GUM",
	"GT": "GTM", "GG": "GGY", "GN": "GIN", "GW": "GNB", "GY": "GUY", "HT": "HTI", "HM": "HMD", "VA": "VAT", "HN": "HND",
	"HK": "HKG", "HU": "HUN", "IS": "ISL", "IN": "IND", "ID": "IDN", "IR": "IRN", "IQ": "IRQ", "IE": "IRL", "IM": "IMN",
	"IL": "ISR", "IT": "ITA", "JM": "JAM", "JP": "JPN", "JE": "JEY", "JO": "JOR", "KZ": "KAZ", "KE": "KEN", "KI": "KIR",
	"KP": "PRK", "KR": "KOR", "KW": "KWT", "KG": "KGZ", "LA": "LAO", "LV": "LVA", "LB": "LBN", "LS": "LSO", "LR": "LBR",
	"LY": "LBY", "LI": "LIE", "LT": "LTU", "LU": "LUX", "MO": "MAC", "MK": "MKD", "MG": "MDG", "MW": "MWI", "MY": "MYS",
	"MV": "MDV", "ML": "MLI", "MT": "MLT", "MH": "MHL", "MQ": "MTQ", "MR": "MRT", "MU": "MUS", "YT": "MYT", "MX": "MEX",
	"FM": "FSM", "MD": "MDA", "MC": "MCO", "MN": "MNG", "ME": "MNE", "MS": "MSR", "MA": "MAR", "MZ": "MOZ", "MM": "MMR",
	"NA": "NAM", "NR": "NRU", "NP": "NPL", "NL": "NLD", "NC": "NCL", "NZ": "NZL", "NI": "NIC", "NE": "NER", "NG": "NGA",
	"NU": "NIU", "NF": "NFK", "MP": "MNP", "NO": "NOR", "OM": "OMN", "PK": "PAK", "PW": "PLW", "PS": "PSE", "PA": "PAN",
	"PG": "PNG", "PY": "PRY", "PE": "PER", "PH": "PHL", "PN": "PCN", "PL": "POL", "PT": "PRT", "PR": "PRI", "QA": "QAT",
	"RE": "REU", "RO": "ROU", "RU": "RUS", "RW": "RWA", "BL": "BLM", "SH": "SHN", "KN": "KNA", "LC": "LCA", "MF": "MAF",
	"PM": "SPM", "VC": "VCT", "WS": "WSM", "SM": "SMR", "ST": "STP", "SA": "SAU", "SN": "SEN", "RS": "SRB", "SC": "SYC",
	"SL": "SLE", "SG": "SGP", "SX": "SXM", "SK": "SVK", "SI": "SVN", "SB": "SLB", "SO": "SOM", "ZA": "ZAF", "GS": "SGS",
	"SS": "SSD", "ES": "ESP", "LK": "LKA", "SD": "SDN", "SR": "SUR", "SJ": "SJM", "SZ": "SWZ", "SE": "SWE", "CH": "CHE",
	"SY": "SYR", "TW": "TWN", "TJ": "TJK", "TZ": "TZA", "TH": "THA", "TL": "TLS", "TG": "TGO", "TK": "TKL", "TO": "TON",
	"TT": "TTO", "TN": "TUN", "TR": "TUR", "TM": "TKM", "TC": "TCA", "TV": "TUV", "UG": "UGA", "UA": "UKR", "AE": "ARE",
	"GB": "GBR", "US": "USA", "UM": "UMI", "UY": "URY", "UZ": "UZB", "VU": "VUT", "VE": "VEN", "VN": "VNM", "VG": "VGB",
	"VI": "VIR", "WF": "WLF", "EH": "ESH", "YE": "YEM", "ZM": "ZMB", "ZW": "ZWE",
}

var CountryMap = map[string]int{
	"": 0, "RU": 1, "KZ": 2, "UA": 3, "FR": 4, "DE": 5, "SE": 6, "IT": 7, "GR": 8, "NL": 9, "ES": 10, "AT": 11,
	"GB": 12, "BE": 13, "CH": 14, "PT": 15, "DK": 16, "NO": 17, "CZ": 18, "RO": 19, "HU": 20, "BG": 21, "LV": 22,
	"CY": 23, "HR": 24, "LU": 25, "IE": 26, "FI": 27, "PL": 28, "BA": 29, "MK": 30, "RS": 31, "MT": 32, "SK": 33,
	"LT": 34, "IS": 35, "SI": 36, "MD": 37, "LI": 38, "EE": 39, "BY": 40, "AD": 41, "AL": 42, "FO": 43, "GI": 44,
	"MC": 45, "ME": 46, "SM": 47, "VA": 48, "US": 49, "CA": 50, "AZ": 51, "CN": 52, "JP": 53, "KP": 54, "IN": 55,
	"BD": 56, "IL": 57, "BR": 58, "AR": 59, "CL": 60, "VE": 61, "CU": 62, "MX": 63, "UY": 64, "PY": 65, "CO": 66,
	"BO": 67, "HN": 68, "GT": 69, "DO": 70, "CR": 71, "NI": 72, "PA": 73, "PE": 74, "SV": 75, "EC": 76, "PR": 77,
	"TH": 78, "VN": 79, "ID": 80, "PH": 81, "LA": 82, "KH": 83, "MY": 84, "SG": 85, "EG": 86, "TN": 87, "LY": 88,
	"MA": 89, "ZA": 90, "AE": 91, "SY": 92, "JO": 93, "SA": 94, "IR": 95, "IQ": 96, "LB": 97, "QA": 98, "YE": 99,
	"KW": 100, "OM": 101, "BH": 102, "TR": 103, "GE": 104, "AU": 105, "BZ": 106, "NG": 107, "ZM": 108, "VG": 109,
	"AF": 110, "UZ": 111, "HK": 112, "NZ": 113, "PK": 114, "PS": 115, "KE": 116, "CD": 117, "SC": 118, "MU": 119,
	"BS": 120, "KR": 121, "BI": 122, "ZW": 123, "AO": 124, "JE": 125, "SN": 126, "KG": 127, "IM": 128, "GG": 129,
	"AM": 130, "TW": 131, "VC": 132, "NA": 133, "GA": 134, "GP": 135, "MQ": 136, "GY": 137, "LK": 138, "DM": 139,
	"BL": 140, "AQ": 141, "SZ": 142, "KN": 143, "WS": 144, "AW": 145, "TJ": 146, "AG": 147, "GL": 148, "TD": 149,
	"SR": 150, "CK": 151, "NU": 152, "TF": 153, "YT": 154, "NC": 155, "NF": 156, "GM": 157, "MG": 158, "MZ": 159,
	"NP": 160, "BN": 161, "TM": 162, "PN": 163, "AX": 164, "SJ": 165, "CC": 166, "NR": 167, "GS": 168, "UM": 169,
	"SX": 170, "ET": 171, "DJ": 172, "CF": 173, "PM": 174, "KM": 175, "TZ": 176, "ST": 177, "FK": 178, "UG": 179,
	"MP": 180, "TL": 181, "WF": 182, "SS": 183, "BQ": 184, "CW": 185, "GH": 186, "NE": 187, "BT": 188, "FJ": 189,
	"MO": 190, "MV": 191, "MM": 192, "PG": 193, "VU": 194, "KI": 195, "MH": 196, "FM": 197, "PW": 198, "SB": 199,
	"TO": 200, "TV": 201, "GF": 202, "DZ": 203, "BJ": 204, "BW": 205, "BF": 206, "CM": 207, "CV": 208, "CG": 209,
	"GQ": 210, "ER": 211, "GN": 212, "GW": 213, "CI": 214, "LS": 215, "LR": 216, "MW": 217, "ML": 218, "MR": 219,
	"RW": 220, "SL": 221, "SO": 222, "SD": 223, "TG": 224, "BB": 225, "GD": 226, "HT": 227, "JM": 228, "LC": 229,
	"TT": 230, "MN": 231, "CS": 232, "YU": 233, "RE": 234, "KY": 235, "BM": 236, "AS": 237, "MF": 238, "TC": 239,
	"IO": 240, "TK": 241, "PF": 242, "AN": 243,
}

var RegionMap = map[string]int{
	"": 0, "Москва": 1, "Орловская область": 2, "Волгоградская область": 3, "Пермский край": 4, "Читинская область": 5,
	"Саха (Якутия)": 6, "Санкт-Петербург": 7, "Краснодарский край": 8, "Татарстан": 9, "Самарская область": 10,
	"Ярославская область": 11, "Хабаровский край": 12, "Архангельская область": 13, "Вологодская область": 14,
	"Новгородская область": 15, "Амурская область": 16, "Брянская область": 17, "Красноярский край": 18,
	"Курская область": 19, "Белгородская область": 20, "Московская область": 21, "Псковская область": 22,
	"Оренбургская область": 23, "Хакасия": 24, "Мордовия": 25, "Ульяновская область": 26, "Пензенская область": 27,
	"Бурятия": 28, "Свердловская область": 29, "Владимирская область": 30, "Чувашия": 31, "Ростовская область": 32,
	"Дагестан": 33, "Калужская область": 34, "Астраханская область": 35, "Воронежская область": 36,
	"Тамбовская область": 37, "Калининградская область": 38, "Иркутская область": 39, "Еврейская автономная область": 40,
	"Челябинская область": 41, "Рязанская область": 42, "Приморский край": 43, "Саратовская область": 44,
	"Алтайский край": 45, "Ставропольский край": 46, "Нижегородская область": 47, "Новосибирская область": 48,
	"Удмуртия": 49, "Башкортостан": 50, "Мурманская область": 51, "Сахалинская область": 52, "Липецкая область": 53,
	"Магаданская область": 54, "Томская область": 55, "Карачаево-Черкесия": 56, "Тверская область": 57,
	"Кемеровская область": 58, "Марий Эл": 59, "Адыгея": 60, "Ивановская область": 61, "Ханты-Мансийский автономный округ - Югра": 62,
	"Тульская область": 63, "Курганская область": 64, "Коми": 65, "Омская область": 66, "Кабардино-Балкария": 67,
	"Калмыкия": 68, "Кировская область": 69, "Камчатский край": 70, "Костромская область": 71, "Северная Осетия": 72,
	"Тюменская область": 73, "Смоленская область": 74, "Карелия": 75, "Ленинградская область": 76,
	"Ямало-Ненецкий автономный округ": 77, "Республика Ингушетия": 78, "Республика Чечня": 79, "Чукотский автономный округ": 80,
	"Республика Тыва (Тува)": 81, "Республика Алтай": 82, "Казахстан": 83, "Забайкальский край": 84,
	"Ненецкий автономный округ": 85, "Республика Марий Эл": 86, "Киев": 87, "Ровненская область": 88,
	"Днепропетровская область": 89, "Запорожская область": 90, "Харьковская область": 91, "Донецкая область": 92,
	"Севастополь": 93, "Львовская область": 94, "Тернопольская область": 95, "Полтавская область": 96, "Крым": 97,
	"Николаевская область": 98, "Одесская область": 99, "Луганская область": 100, "Житомирская область": 101,
	"Волынская область": 102, "Черкасская область": 103, "Закарпатская область": 104, "Херсонская область": 105,
	"Винницкая область": 106, "Хмельницкая область": 107, "Киевская область": 108, "Черниговская область": 109,
	"Ивано-Франковская область": 110, "Черновицкая область": 111, "Сумская область": 112, "Кировоградская область": 113,
	"Франция": 114, "Германия": 115, "Швеция": 116, "Италия": 117, "Греция": 118, "Нидерланды (Голландия)": 119,
	"Испания, Канары": 120, "Австрия": 121, "Великобритания": 122, "Бельгия": 123, "Швейцария": 124, "Португалия": 125,
	"Дания": 126, "Норвегия": 127, "Чехия": 128, "Румыния": 129, "Венгрия": 130, "Болгария": 131, "Латвия": 132,
	"Кипр": 133, "Хорватия": 134, "Люксембург": 135, "Ирландия": 136, "Финляндия": 137, "Польша": 138,
	"Босния и Герцеговина": 139, "Македония": 140, "Сербия": 141, "Мальта": 142, "Словакия": 143, "Литва": 144,
	"Исландия": 145, "Словения": 146, "Молдавия": 147, "Лихтенштейн": 148, "Эстония": 149, "Белоруссия": 150,
	"Андорра": 151, "Албания": 152, "Фарерские острова": 153, "Гибралтар": 154, "Монако": 155, "Черногория": 156,
	"Сан-Марино": 157, "Ватикан": 158,
}

var CityMap = map[string]int{
	"": 0, "Неизвестно": 0, "Москва": 1, "Орел": 2, "Волжский": 3, "Зеленоград": 4, "Пермь": 5, "Чита": 6, "Мирный": 7,
	"Санкт-Петербург": 8, "Краснодар": 9, "Нижнекамск": 10, "Самара": 11, "Ярославль": 12, "Хабаровск": 13, "Архангельск": 14,
	"Вологда": 15, "Ростов": 16, "Великий Новгород": 17, "Тында": 18, "Брянск": 19, "Ачинск": 20, "Курск": 21, "Белгород": 22,
	"Ступино": 23, "Псков": 24, "Оренбург": 25, "Абакан": 26, "Рузаевка": 27, "Ульяновск": 28, "Пенза": 29, "Волгоград": 30,
	"Саранск": 31, "Димитровград": 32, "Северобайкальск": 33, "Красноярск": 34, "Первоуральск": 35, "Александров": 36,
	"Чебоксары": 37, "Новочеркасск": 38, "Махачкала": 39, "Обнинск": 40, "Астрахань": 41, "Россошь": 42, "Абдулино": 43,
	"Тамбов": 44, "Ростов-на-Дону": 45, "Алексеевка": 46, "Кизляр": 47, "Калининград": 48, "Комсомольск-на-Амуре": 49, "Заречный": 50,
	"Железногорск-Илимский": 51, "Биробиджан": 52, "Сызрань": 53, "Улан-Удэ": 54, "Челябинск": 55, "Рязань": 56, "Владивосток": 57,
	"Ангарск": 58, "Екатеринбург": 59, "Саратов": 60, "Тихорецк": 61, "Балашов": 62, "Барнаул": 63, "Находка": 64, "Ставрополь": 65,
	"Иркутск": 66, "Таксимо": 67, "Железногорск": 68, "Нижний Новгород": 69, "Братск": 70, "Куанда": 71, "Канск": 72,
	"Новосибирск": 73, "Сергиев Посад": 74, "Касторное": 75, "Ковров": 76, "Зеленогорск": 77, "Уссурийск": 78, "Лучегорск": 79,
	"Кисловодск": 80, "Ижевск": 81, "Саяногорск": 82, "Луховицы": 83, "Уфа": 84, "Сковородино": 85, "Коломна": 86,
	"Усть-Кинельский": 87, "Мурманск": 88, "Воронеж": 89, "Сарапул": 90, "Миасс": 91, "Южно-Сахалинск": 92, "Старый Оскол": 93,
	"Липецк": 94, "Истра": 95, "Шатура": 96, "Михнево": 97, "Черноголовка": 98, "Купавна": 99, "Норильск": 100, "Магадан": 101,
	"Томск": 102, "Северск": 103, "Тольятти": 104, "Нижний Архыз": 105, "Тверь": 106, "Конаково": 107, "Анжеро-Судженск": 108,
	"Кемерово": 109, "Владимир": 110, "Благовещенск": 111, "Йошкар-Ола": 112, "Таганрог": 113, "Майкоп": 114, "Дубна": 115,
	"Череповец": 116, "Иваново": 117, "Альметьевск": 118, "Ханты-Мансийск": 119, "Новороссийск": 120, "Красногорск": 121, "Нахабино": 122,
	"Видное": 123, "Тула": 124, "Химки": 125, "Внуково": 126, "Кандалакша": 127, "Казань": 128, "Одинцово": 130,
	"Люберцы": 131, "Жуковский": 132, "Балашиха": 133, "Дзержинский": 134, "Раменское": 135, "Королев": 136,
	"Долгопрудный": 137, "Реутов": 138, "Пушкино": 139, "Лобня": 140, "Мытищи": 141, "Малаховка": 142, "Лыткарино": 143,
	"Подольск": 144, "Фрязино": 145, "Руза": 146, "Павловская": 147, "Калуга": 148, "Магнитогорск": 149, "Снежинск": 150,
	"Озерск": 151, "Курган": 152, "Златоуст": 153, "Пущино": 154, "Нижняя Тура": 155, "Серов": 156, "Сургут": 157,
	"Сыктывкар": 158, "Сочи": 159, "Омск": 160, "Черкесск": 161, "Нальчик": 162, "Элиста": 163, "Краснознаменск": 164,
	"Жигулевск": 165, "Новокуйбышевск": 166, "Кодинск": 167, "Геленджик": 168, "Новокузнецк": 169, "Артем": 170,
	"Ессентуки": 171, "Буденновск": 172, "Пятигорск": 173, "Светлоград": 174, "Воткинск": 175, "Серпухов": 176,
	"Азов": 177, "Шахты": 178, "Киров": 179, "Кирово-Чепецк": 180, "Каменск-Шахтинский": 181, "Петропавловск-Камчатский": 182,
	"Камышин": 183, "Электросталь": 184, "Урай": 185, "Янаул": 186, "Стерлитамак": 187, "Наро-Фоминск": 188,
	"Железнодорожный": 189, "Щелково": 190, "Кострома": 191, "Владикавказ": 192, "Нижневартовск": 193, "Якутск": 194,
	"Тюмень": 195, "Трехгорный": 196, "Смоленск": 197, "Петрозаводск": 198, "Энгельс": 199, "Печора": 200, "Бийск": 201,
	"Каменск-Уральский": 202, "Ногинск": 203, "Новомосковск": 204, "Арзамас": 205, "Алдан": 206, "Тарко-сале": 207,
	"Гатчина": 208, "Набережные Челны": 209, "Нижний Тагил": 210, "Кушва": 211, "Удомля": 212, "Кириши": 213,
	"Солнечногорск": 214, "Выборг": 215, "Клин": 216, "Волгодонск": 217, "Старая Купавна": 218, "Реж": 219, "Новоуральск": 220,
	"Артемовский": 221, "Краснотурьинск": 222, "Качканар": 223, "Ухта": 224, "Анна": 225, "Бутурлиновка": 226,
	"Ольховатка": 227, "Бобров": 228, "Борисоглебск": 229, "Лиски": 230, "Богучар": 231, "Воробьевка": 232, "Кантемировка": 233,
	"Березовский": 234, "Рыбинск": 235, "Надым": 236, "Балаково": 237, "Прохоровка": 238, "Новый Оскол": 239,
	"Ванино": 240, "Вельск": 241, "Невинномысск": 242, "Георгиевск": 243, "Сатка": 244, "Нефтеюганск": 245, "Южноуральск": 246,
	"Шумерля": 247, "Пыть-ях": 248, "Чегдомын": 249, "Березники": 250, "Аша": 251, "Тайшет": 252, "Вязьма": 253,
	"Вырица": 254, "Малоярославец": 255, "Петровское": 256, "Шимановск": 257, "Сортавала": 258, "Валуйки": 259,
	"Белогорск": 260, "Старая Чара": 261, "Нижнеудинск": 262, "Асбест": 263, "Электрогорск": 264, "Протвино": 265,
	"Волоколамск": 266, "п. Лесной Городок": 267, "Миллерово": 268, "Зерноград": 269, "Новошахтинск": 270, "Гуково": 271,
	"Красный Сулин": 272, "Каменоломни": 273, "Сосновоборск": 274, "Дивногорск": 275, "Юрга": 276, "Заринск": 277,
	"Спасск-Дальний": 278, "Михайловка": 279, "Кавалерово": 280, "Дальнегорск": 281, "Пулково": 282, "Глазов": 283,
	"Вурнары": 284, "Отрадное": 285, "Павловский Посад": 286, "Воскресенское": 287, "Троицк": 288, "Сходня": 289,
	"Белые Столбы": 290, "Путилково": 291, "Щербинка": 292, "Село Озерецкое": 293, "Егорьевск": 294, "пос. Горбово": 295,
	"пос. Лесной": 296, "Селятино": 297, "Углич": 298, "Совхоз имени Ленина": 299, "Великие Луки": 300, "Анапа": 301,
	"Кош-Агач": 302, "Новомичуринск": 303, "Прохладный": 304, "Кулицкая": 305, "пос. Картино": 306, "Можайск": 307,
	"Ленинск-Кузнецкий": 308, "Линево": 309, "Кинешма": 310, "Шуя": 311, "Вичуга": 312, "Тейково": 313, "Елабуга": 314,
	"Муром": 315, "Бердск": 316, "Назрань": 317, "Грозный": 318, "Вольск": 319, "Анадырь": 320, "Кызыл": 321,
	"Кольчугино": 322, "Белореченск": 323, "Новокубанск": 324, "Новый Уренгой": 325, "Усинск": 326, "Лабытнанги": 327,
	"Воркута": 328, "Салехард": 329, "Когалым": 330, "Мегион": 331, "Ноябрьск": 332, "Дивное": 333, "Нефтекамск": 334,
	"Ишимбай": 335, "Славянка": 336, "Вольно-Надеждинское": 337, "Трудовое": 338, "Ольга": 339, "Дальнереченск": 340,
	"Лесозаводск": 341, "Яковлевка": 342, "Черниговка": 343, "Кировский": 344, "Арсеньев": 345, "Горно-Алтайск": 346,
	"Рубцовск": 347, "Красноуральск": 348, "Верхняя Пышма": 349, "Полевской": 350, "Ревда": 351, "Сысерть": 352,
	"Мыски": 353, "Белово": 354, "Прокопьевск": 355, "Междуреченск": 356, "Первомайск": 357, "Дзержинск": 358, "Заволжье": 359,
	"Городец": 360, "Балахна": 361, "Навашино": 362, "Бор": 363, "Выкса": 364, "Саров": 365, "Павлово": 366,
	"Кулебаки": 367, "Богородск": 368, "Семенов": 369, "Урень": 370, "Шахунья": 371, "Сергач": 372, "Северодвинск": 373,
	"Шадринск": 374, "Орск": 375, "Новотроицк": 376, "Салават": 377, "Переславль-Залесский": 378, "Сибай": 379,
	"Белорецк": 380, "Соликамск": 381, "Лысьва": 382, "Чайковский": 383, "Нытва": 384, "Чернушка": 385, "Горнозаводск": 386,
	"Краснокамск": 387, "Кунгур": 388, "Кудымкар": 389, "Добрянка": 390, "Чусовой": 391, "Березовка": 392,
	"Карагай": 393, "Губаха": 394, "Очер": 395, "Красновишерск": 396, "Гремячинск": 397, "Оса": 398, "Казанская": 399,
	"Вешенская": 400, "Кагальницкая": 401, "Целина": 402, "Егорлыкская": 403, "Батайск": 404, "Егорлык": 405,
	"Морозовск": 406, "Багаевский": 407, "Аксай": 408, "Веселый": 409, "Гродеково": 410, "Уяр": 411, "Тайга": 412,
	"Кондопога": 413, "Шарья": 414, "Усть-Кут": 415, "Бузулук": 416, "Минусинск": 417, "Грязовец": 418, "Зея": 419,
	"Волжск": 420, "Краснокаменск": 421, "Усть-Катав": 422, "Амурск": 423, "Свободный": 424, "Гагарин": 425,
	"Туапсе": 426, "Ейск": 427, "Лениногорск": 428, "Собинка": 429, "Железноводск": 430, "Минеральные Воды": 431,
	"Нижняя Салда": 432, "Сухой Лог": 433, "Талица": 434, "пос. Шебекино": 435, "Воскресенск": 436, "Дмитров": 437,
	"Гаврилов-ям": 438, "Галенки": 439, "Камень-Рыболов": 440, "Новошахтинский": 441, "Цимлянск": 442, "Орловский": 443,
	"Тарасовский": 444, "Кашары": 445, "Семикаракорск": 446, "Белая Калитва": 447, "Ремонтное": 448, "Чалтырь": 449,
	"Родионово-Несветайская": 450, "Романовская": 451, "Матвеев Курган": 452, "Зимовники": 453, "Константиновск": 454,
	"Сальск": 455, "Коряжма": 456, "Алапаевск": 457, "пос. Вешки": 458, "Холмск": 459, "Репьевка": 460, "Нововоронеж": 461,
	"Калач": 462, "Новая Усмань": 463, "Татищево": 464, "Чапаевск": 465, "Новопавловск": 466, "Луга": 467,
	"Юбилейный": 468, "Кстово": 469, "Черногорск": 470, "Кизел": 471, "Советский": 472, "Сертолово": 473,
	"Вилючинск": 474, "Сосновый Бор": 475, "Кимры": 476, "Нерюнгри": 477, "Курчатов": 478, "Апатиты": 479, "Елань": 480,
	"Урюпинск": 481, "Иловля": 482, "Нехаевский": 483, "Новониколаевский": 484, "Палласовка": 485, "Дубовка": 486,
	"Фролово": 487, "Волхов": 488, "Ярцево": 489, "Всеволожск": 490, "Ивантеевка": 491, "Лосино-Петровский": 492,
	"Дудинка": 493, "Ипатово": 494, "Усть-Илимск": 495, "Шушенское": 496, "Волочаевское": 497, "Мончегорск": 498,
	"Топки": 499, "пос. Заря подмосковья": 500, "Бодайбо": 501, "Тимашевск": 502, "Нарьян-Мар": 503, "Светлый": 504,
	"Копейск": 505, "Пышма": 506, "Румянцево": 507, "Котовск": 508, "Елец": 509, "Лебедянь": 510, "Питкяранта": 511,
	"Горки Ленинские": 512, "Александровск-Сахалинский": 513, "Балабаново": 514, "Сестрорецк": 515, "Далматово": 516,
	"Началово": 517, "Фокино": 518, "Шарыпово": 519, "Лесосибирск": 520, "Домодедово": 521, "Октябрьский": 522,
	"Кыштым": 523, "Карабаш": 524, "Александровск": 525, "Орда": 526, "Стрежевой": 527, "Карпинск": 528, "Сегежа": 529,
	"Кола": 530, "Томилино": 531, "Саракташ": 532, "Гай": 533, "Радужный": 534, "Кумертау": 535, "Средняя Ахтуба": 536,
	"Городище": 537, "Ленинск": 538, "Фрязево": 539, "пос. Смирновка": 540, "Лермонтов": 541, "Тазовский": 542,
	"Менделеевск": 543, "Чертково": 544, "Рославль": 545, "Кировск": 546, "Фурманов": 547, "Медвежьегорск": 548,
	"Забайкальск": 549, "Звенигород": 550, "Канаш": 551, "Тобольск": 552, "Электроугли": 553, "Тихвин": 554, "Ядрин": 555,
	"Чехов": 556, "Орехово-Зуево": 557, "Шерегеш": 558, "Зеленодольск": 559, "Салым": 560, "Микунь": 561, "Бронницы": 562,
	"Назарово": 563, "Новоаннинский": 564, "Калач-на-дону": 565, "Армавир": 566, "Благодарный": 567, "Изобильный": 568,
	"Зеленокумск": 569, "Оленегорск": 570, "Байконур": 571, "Хасавюрт": 572, "Приозерск": 573, "Поронайск": 574,
	"Елизово": 575, "Ленск": 576, "Николаевск": 577, "Чамзинка": 578, "Крымск": 579, "Гудермес": 580, "Светлый Яр": 581,
	"Левокумское": 582, "Александровское": 583, "Киржач": 584, "Лахденпохья": 585, "Жирновск": 586, "Алексин": 587,
	"Кинель": 588, "Старая Полтавка": 589, "Подгоренский": 590, "Губкин": 591, "Голицыно": 592, "Котельники": 593,
	"Кабанск": 594, "Летняя Ставка": 595, "Учалы": 596, "Шаран": 597, "Вихоревка": 598, "Степное": 599, "Курсавка": 600,
	"Арзгир": 601, "Кировград": 602, "Новоалександровск": 603, "Лесной": 604, "Новый Рогачик": 605, "Котово": 606,
	"Пикалево": 607, "Шелехов": 608, "Кашира": 609, "Климовск": 610, "Чудово": 611, "Шебекино": 612, "Сафоново": 613,
	"Калтан": 614, "Навля": 615, "Мичуринск": 616, "Дедовск": 617, "Киселевск": 618, "Советск": 619, "Узловая": 620,
	"Черняховск": 621, "Гусиноозерск": 622, "Нерехта": 623, "Иланский": 624, "Казлук": 625, "Муравленко": 626,
	"Лангепас": 627, "Невьянск": 628, "Таштагол": 629, "Демидово": 630, "Увельский": 631, "Туймазы": 632, "Новый Ургал": 633,
	"Светлогорск": 634, "Боровичи": 635, "Красный Яр": 636, "Ясный": 637, "Хороль": 638, "Терней": 639, "Большой Камень": 640,
	"Маркс": 641, "Красноармейск": 642, "Еманжелинск": 643, "Шумиха": 644, "Верхний Уфалей": 645, "Советская Гавань": 646,
	"Котельниково": 647, "Старая Русса": 648, "Великий Устюг": 649, "Покровское": 650, "Десногорск": 651, "Новочебоксарск": 652,
	"Снежногорск": 653, "Заполярный": 654, "Зарайск": 655, "Мышкин": 656, "Анива": 657, "Тутаев": 658, "Ахтубинск": 659,
	"Тымовское": 660, "Хилок": 661, "Шилка": 662, "Ерофей-Павлович": 663, "Чернышевск": 664, "Менделеево": 665, "Могоча": 666,
	"Краснослободск": 667, "Рудня": 668, "Вышний Волочек": 669, "Югорск": 670, "Бологое": 671, "Искитим": 672, "Корсаков": 673,
	"Яранск": 674, "Красноуфимск": 675, "Покров": 676, "Нижние Серги": 677, "Солнечная Долина": 678, "Яхрома": 679,
	"Чебаркуль": 680, "Абинск": 681, "Инжавино": 682, "Зима": 683, "Вятские Поляны": 684, "Новодвинск": 685, "Аткарск": 686,
	"Баргузин": 687, "Мариинск": 688, "Инта": 689, "Темрюк": 690, "Каневская": 691, "Песьянка": 692, "Ряжск": 693,
	"Верхняя Салда": 694, "Покровка": 695, "Адлер": 696, "Апрелевка": 697, "Лысково": 698, "Гусь Хрустальный": 699,
	"Касимов": 700, "Каспийск": 701, "Юрюзань": 702, "Боровск": 703, "Буйнакск": 704, "Кузнецк": 705, "Суворов": 706,
	"Николаевск-на-Амуре": 707, "Беслан": 708, "Калязин": 709, "Славянск-на-Кубани": 710, "Нефтегорск": 711, "Бирск": 712,
	"Волосово": 713, "Нефтекумск": 714, "Коркино": 715, "Выселки": 716, "Киев": 717, "Ровно": 718, "Днепропетровск": 719,
	"Запорожье": 720, "Харьков": 721, "Мариуполь": 722, "Севастополь": 723, "Донецк": 724, "Макеевка": 725, "Львов": 726,
	"Тернополь": 727, "Кременчуг": 728, "Керчь": 729, "Николаев": 730, "Одесса": 731, "Теплодар": 732, "Алчевск": 733,
	"Бердичев": 734, "Ковель": 735, "Смела": 736, "Перечин": 737, "Новая Каховка": 738, "Винница": 739, "Южноукраинск": 740,
	"Каменец-Подольский": 741, "Житомир": 742, "Васильков": 743, "Виноградов": 744, "Северодонецк": 745, "Днепродзержинск": 746,
	"Чернигов": 747, "Белая Церковь": 748, "Евпатория": 749, "Павлоград": 750, "Краснодон": 751, "Ивано-Франковск": 752,
	"Черновцы": 753, "Кельменцы": 754, "Симферополь": 755, "Сумы": 756, "Обухов": 757, "Городок": 758, "Фастов": 759,
	"Вишнёвое": 760, "Черкассы": 761, "Белгород-Днестровский": 762, "Хмельницкий": 763, "Волочиск": 764, "Марганец": 765,
	"Купянск": 766, "Калуш": 767, "Мелитополь": 768, "Луганск": 769, "Черневцы": 770, "Ирпень": 771, "Харцызск": 772,
	"Умань": 773, "Ялта": 774, "Саки": 775, "Борисполь": 776, "Феодосия": 777, "Красноград": 778, "Кировоград": 779,
	"Лисичанск": 780, "Луцк": 781, "Червоноград": 782, "Бережаны": 783, "Бурштын": 784, "Козова": 785, "Нетишин": 786,
	"Овруч": 787, "Красноперекопск": 788, "Золотоноша": 789, "Коломыя": 790, "Клевань": 791, "Херсон": 792, "Беляевка": 793,
	"Ужгород": 794, "Бровары": 795, "Кривой Рог": 796, "Орджоникидзе": 797, "Овидиополь": 798, "Ильичёвск": 799,
	"Славутич": 800, "Полтава": 801, "Краматорск": 802, "Сокаль": 803, "Макаров": 804, "Барышевка": 805, "Чугуев": 806,
	"Славута": 807, "Александровка": 808, "Никополь": 809, "Энергодар": 810, "Алушта": 811, "Шостка": 812, "Приморск": 813,
	"Южное": 814, "Богуслав": 815, "Переяслав-Хмельницкий": 816, "Вознесенск": 817, "Новый Буг": 818, "Калиновка": 819,
	"Рубежное": 820, "Новоград-Волынский": 821, "Вышгород": 822, "Комсомольское": 823, "Стаханов": 824, "Первомайский": 825,
	"Шепетовка": 826, "Изяслав": 827, "Полонное": 828, "Дунаевцы": 829, "Деражня": 830, "Летичев": 831, "Теофиполь": 832,
	"Староконстантинов": 833, "Красилов": 834, "Казатин": 835, "Чернобыль": 836, "Свалява": 837, "Высокий": 838, "Джанкой": 839,
	"Щёлкино": 840, "Судак": 841, "Горловка": 842, "Токмак": 843, "Бахчисарай": 844, "Ахтырка": 845, "Волоконовка": 846,
	"Александрия": 847, "Владимир-Волынский": 848, "Кролевец": 849, "Бердянск": 850, "Буча": 851, "Зазимье": 852, "Золочев": 853,
	"Гуляйполе": 854, "Лозовая": 855, "Новотроицкое": 856, "Сарны": 857, "Хуст": 858, "Боярка": 859, "Малин": 860,
	"Изюм": 861, "Конотоп": 862, "Нововолынск": 863, "Енакиево": 864, "Кузнецовск": 865, "Здолбунов": 866, "Селидово": 867,
	"Песочин": 868, "Овлаши": 869, "Жёлтые Воды": 870, "Тячев": 871, "Артёмовск": 872, "Лутугино": 873, "Богодухов": 874,
	"Хмельник": 875, "Курахово": 876, "Константиновка": 877, "Молодогвардейск": 878, "Глыбокая": 879, "Коростень": 880,
	"Ясиноватая": 881, "Сокиряны": 882, "Стрый": 883, "Дебальцево": 884, "Солоницевка": 885, "Терновка": 886, "Трускавец": 887,
	"Красный Луч": 888, "Антрацит": 889, "Ровеньки": 890, "Галич": 891, "Угледар": 892, "Берегово": 893, "Кременец": 894,
	"Костополь": 895, "Армянск": 896, "Цюрупинск": 897, "Мукачево": 898, "Каховка": 899, "Балаклея": 900, "Яремче": 901,
	"Карловка": 902, "Ромны": 903, "Могилёв-Подольский": 904, "Алупка": 905, "Яворов": 906, "Свесса": 907, "Вилково": 908,
	"Славянск": 909, "Авдеевка": 910, "Торез": 911, "Докучаевск": 912, "Новогродовка": 913, "Орлов": 914, "Яготин": 915,
	"Дружковка": 916, "Бабаево": 917, "Попельня": 918, "Нижнегорский": 919, "Миргород": 920, "Канев": 921, "Носовка": 922,
	"Комсомольск": 923, "Димитров": 924, "Доброполье": 925, "Новодружеск": 926, "Дрогобыч": 927, "Кицмань": 928, "Снежное": 929,
	"Болград": 930, "Ичня": 931, "Бучач": 932, "Измаил": 933, "Каменка": 934, "Мерефа": 935, "Борислав": 936, "Украинка": 937,
	"Бурынь": 938, "Пирятин": 939, "Геническ": 940, "Килия": 941, "Баштанка": 942, "Городенка": 943, "Гадяч": 944,
	"Шаргород": 945, "Рогатин": 946, "Корсунь-Шевченковский": 947, "Знаменка": 948, "Вольногорск": 949, "Свердловск": 950,
	"Узин": 951, "Бородянка": 952, "Змиёв": 953, "Варва": 954, "Десна": 955, "Нежин": 956, "Оноковцы": 957, "Иршава": 958,
	"Збараж": 959, "Лиманское": 960, "Бахмач": 961, "Скадовск": 962, "Волчанск": 963, "Старобельск": 964, "Броды": 965,
	"Новоднестровск": 966, "Рахов": 967, "Лебедин": 968, "Прилуки": 969, "Королёво": 970, "Катеринополь": 971, "Дергачи": 972,
	"Жидачов": 973, "Кременная": 974, "Амвросиевка": 975, "Валки": 976, "Мамаевцы": 977, "Дубровица": 978, "Коцюбинское": 979,
	"Научный": 980, "Рокитное": 981, "Чернобай": 982, "Шацк": 983, "Светловодск": 984, "Марковка": 985, "Рожище": 986,
	"Богородчаны": 987, "Добромиль": 988, "Каменка Бугская": 989, "Красный Лиман": 990, "Ефремов": 991, "Таврийск": 992,
	"Мостиска": 993, "Помошная": 994, "Голая Пристань": 995, "Белокуракино": 996, "Сватово": 997, "Взморье": 998,
	"Курагино": 999, "Богданович": 1000, "Гулькевичи": 1001, "Серебряные Пруды": 1002, "Днепрорудное": 1003, "Медногорск": 1004,
	"Кировское": 1005, "Снятын": 1006, "Курганинск": 1007, "Жуковка": 1008, "Кагарлык": 1009, "Лубны": 1010, "Приморско-Ахтарск": 1011,
	"Радомышль": 1012, "Пустомыты": 1013, "Новый Раздол": 1014, "Каменка-Днепровская": 1015, "Алатырь": 1016, "Жолква": 1017,
	"Великая Лепетиха": 1018, "Можга": 1019, "Куйбышев": 1020, "Тосно": 1021, "Косов": 1022, "Кириллов": 1023, "Укромное": 1024,
	"Тлумач": 1025, "Болехов": 1026, "Ржакса": 1027, "Алейск": 1028, "Козелец": 1029, "Южное ": 1030, "Недригайлов": 1031,
	"Панино": 1032, "Сторожинец": 1033, "Снятын ": 1034, "Брянка": 1035, "Олевск": 1036,
}

func CountryMapping(val string) (result int) {

	if mapVal, ok := CountryMap[val]; ok {
		result = mapVal
	}

	return
}

func RegionMapping(val string) (result int) {

	if mapVal, ok := RegionMap[val]; ok {
		result = mapVal
	}
	return
}

func CityMapping(val string) (result int) {

	if mapVal, ok := CityMap[val]; ok {
		result = mapVal
	}
	return
}

func ISO_3166_1_alpha_3Mapping(val string) (result string) {

	if mapVal, ok := ISO_3166_1_alpha_3[val]; ok {
		result = mapVal
	}
	return
}

func DeviceMapping(device Device, os Platform) (result int) {

	result = COMPUTERS

	if device.Type == "TV Device" {
		if device.Brand == "Samsung" {
			result = SMART_TV_TIZEN
		} else {
			result = SMART_TV_WEBOS
		}
	}
	if device.Type == "Desktop" {
		if os.Short == "win" {
			result = WINDOWS
		} else {
			if os.Short == "mac" {
				result = MAC_OS
			} else {
				result = COMPUTERS_OTHER
			}
		}
	}
	if device.Type == "Tablet" {
		if os.Short == "android" {
			result = TABLET_ANDROID
		} else {
			if os.Short == "ios" {
				result = TABLET_IOS
			} else {
				result = TABLET_OTHER
			}
		}
	}
	if device.Type == "Mobile Phone" {
		if os.Short == "android" {
			result = MOBILE_ANDROID
		} else {
			if os.Short == "ios" {
				result = MOBILE_IOS
			} else {
				if os.Short == "win" {
					result = WINDOWS_PHONE
				} else {
					result = MOBILE_OTHER
				}
			}
		}
	}

	return
}
